#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main(void)
{
	int menu, sum, i, j;
	
	sum = 0;

	printf("*******************************************************************\n");
	printf("¸Þ´º :1.±è¹ä-3000¿ø 2.¶±ººÀÌ-3500¿ø 3.µ·±î½º-6500¿ø 4.±èÄ¡ººÀ½¹ä-6000¿ø\n");
	printf("*******************************************************************\n");
	printf("ÁÖ¹® À¾½Ä¼ö : ");
	scanf("%d", &i);

	for (j = 1; j <= i; j++)
	{
		printf("%d¹øÂ° ÁÖ¹®ÇÏ½Ç À½½ÄÀº? ", j);
		scanf("%d", &menu);

		if (menu == 1)
			sum += 3000;
		else if (menu == 2)
			sum += 3500;
		else if (menu == 3)
			sum += 6500;
		else if (menu == 4)
			sum += 6000;
		else
			j--;
	}
	printf("*******************************************************************\n");
	printf("ÇÕ°è±Ý¾× : %d¿øÀÔ´Ï´Ù.\n", sum);
	printf("*******************************************************************\n");

	return 0;
}